// © Copyright 2004-2012, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Clean Printheads";

NotInitiatedTitle = "Cleaning could not be initiated";
NotInitiatedMsg = "The cleaning procedure could not be initiated. Please check that the printer is online and is not processing any jobs.";

CleaningProgressTitle = "Printhead Cleaning is in progress…";

CompletitionLevelTitleFormat = "Cleaning Level %i Performed";
CompletitionLevelMsgFormat = "Please wait while the test page is printed. Check this page to see if the problem was fixed. If the test page looks fine click Finish to quit cleaning procedure. Otherwise click Cleaning Level %i to continue with cleaning.";
CompletitionFinalMsg = "Please wait while the test page is printed. Check this page to see if the problem was fixed. If the test page looks fine click Finish to quit cleaning procedure. Otherwise click Get HP Help Online to go to HP troubleshooting web page.";
NextLevelButtonFormat = "Cleaning Level %i";
FinishButtonText = "Finish";
GetHelpButtonText = "Get HP Help Online";

HSDCleanPrintheadsExplanation = "If your printed output is streaked like the example, the printheads need to be cleaned. This takes about one minute and uses one sheet of paper.";
HSDCleanPrintheadsInvitation = "Click the Clean button to clean the printheads now.";
HSDManualCleanPrintheadsInvitation = "To clean the printhead please select corresponding option on the printer's control panel display.";

CleanCancelledTitle = "Operation is canceled";
CleanCancelledMsg = "The cleaning procedure was canceled from the device front panel.";

CleaningProcessErrorTitle = "Cannot complete operation";
CleaningProcessErrorMsg = "The cleaning procedure could not be completeted. Please contact HP Support.";
DeviceBusyMessage = "Please wait while the device finishes its current job and try again.";

PythonLvl1DoneTitle = "First Level Printhead Cleaning is complete";

PythonLvl1DoneMsg = "If the print quality is still unacceptable, a Second Level clean is available. This takes about 2 minutes and will use one sheet of paper. This Second Level clean will use a significant amount of ink, and should only be used if the initial cleaning did not improve Print Quality. To do the Second Level clean, click \“Second Level Clean\”.";
PythonLvl1DoneMsgPigment = "If the print quality is still unacceptable, a Second Level clean is available. This takes about 2 minutes and will use one sheet of paper. This Second Level clean will use a significant amount of cartridge supplies, and should only be used if the initial cleaning did not improve Print Quality. To do the Second Level clean, click \“Second Level Clean\”.";
PythonLvl2Button = "Second Level Clean";

PythonLvl2DoneTitle = "Second Level Printhead Cleaning is complete";

PythonLvl2DoneMsg = "If the print quality still does not look good, running this procedure again will probably not help. Refer to printer documentation for further information.";

ColorCleaningTextFieldTitle = "Clean Printheads";
HSDInfoTextFieldTitle = "If your printed output is streaked like the example on the picture, or has any incorrect or missing colors, the printheads may need to be cleaned. This process uses ink to attempt to clean nozzles in the printheads. This will take about 2 minutes and will use one sheet of paper.";
HSDInfoTextFieldTitlePigment = "If your printed output is streaked like the example on the picture, or has any incorrect or missing colors, the printheads may need to be cleaned. This process uses cartridge to attempt to clean nozzles in the printheads. This will take about 2 minutes and will use one sheet of paper.";
HSDGuideTextFieldTitle = "Click “Clean” to clean the printheads now.";
HSDCleanButtonTitle = "Clean";
CancelButtonTitleKey = "Cancel";
